OpenFOAM_Maincode/tutorials/incompressibleVoF/floatingObjectWaves/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 -0.5 0)
    ( 1.5 -0.5 0)
    ( 1.5  1.5 0)
    (-0.5  1.5 0)
    (-0.5 -0.5 1)
    ( 1.5 -0.5 1)
    ( 1.5  1.5 1)
    (-0.5  1.5 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 30) simpleGrading (1 1 1)
);

boundary
(
    sides
    {
        type patch;
        faces
        (
            (2 6 5 1)
            (1 5 4 0)
            (3 7 6 2)
            (0 4 7 3)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    floatingObject
    {
        type wall;
        faces ();
    }

    internal
    {
        type internal;
        faces ();
    }
);


// ************************************************************************* //
